# Ejercicios diarios mySQL

## Importacion de los datos y librerias

In [25]:
## Conectarse a docker y pandas
import pandas as pd
import os
from sqlalchemy import create_engine

In [26]:
from dotenv import load_dotenv
import cryptography
load_dotenv("credenciales/sakila.env")

True

## Creacion usuario para conectarse a base de datos

In [27]:
user = os.getenv("MYSQL_USER")
pwd  = os.environ["MYSQL_PASSWORD"]
host = os.getenv("MYSQL_HOST")
port = os.getenv("MYSQL_PORT")
db   = os.getenv("MYSQL_DB")

engine = create_engine(f"mysql+pymysql://{user}:{pwd}@{host}:{port}/{db}")

In [28]:
print("cwd:", os.getcwd())
print("MYSQL_USER:", os.getenv("MYSQL_USER"))
print("MYSQL_PASSWORD existe?:", os.getenv("MYSQL_PASSWORD") is not None)
print("MYSQL_DB existe?:", os.getenv("MYSQL_DB"))

cwd: c:\Users\workw\Documents\practicar programacion\sql
MYSQL_USER: usuario_sakila
MYSQL_PASSWORD existe?: True
MYSQL_DB existe?: sakila

## Practica clausulas y operadores

In [29]:
pd.read_sql("SHOW TABLES;", engine)

              Tables_in_sakila
0                        actor
1                   actor_info
2                      address
3                     category
4                         city
5                      country
6                     customer
7                customer_list
8                         film
9                   film_actor
10               film_category
11                   film_list
12                   film_text
13                   inventory
14                    language
15  nicer_but_slower_film_list
16                     payment
17                      rental
18      sales_by_film_category
19              sales_by_store
20                       staff
21                  staff_list
22                       store

In [30]:
pd.read_sql("SELECT category, COUNT(*) AS n FROM film_list GROUP BY category ORDER BY n DESC;", engine)

       category   n
0        Sports  74
1       Foreign  73
2        Family  69
3   Documentary  68
4     Animation  66
5        Action  64
6           New  63
7         Drama  62
8        Sci-Fi  61
9         Games  61
10     Children  60
11       Comedy  58
12     Classics  57
13       Travel  57
14       Horror  56
15        Music  51

In [31]:
pd.read_sql("DESCRIBE film_list;", engine)

         Field                                Type Null Key Default Extra
0          FID                   smallint unsigned   NO           0
1        title                        varchar(128)   NO         NaN
2  description                                text  YES         NaN
3     category                         varchar(25)  YES         NaN
4        price                        decimal(4,2)   NO        4.99
5       length                   smallint unsigned  YES         NaN
6       rating  enum('G','PG','PG-13','R','NC-17')  YES           G
7       actors                                text  YES         NaN

In [32]:
pd.read_sql("SELECT title FROM film_list;", engine)

                 title
0     ACADEMY DINOSAUR
1       ACE GOLDFINGER
2     ADAPTATION HOLES
3     AFFAIR PREJUDICE
4          AFRICAN EGG
..                 ...
995     YOUNG LANGUAGE
996         YOUTH KICK
997       ZHIVAGO CORE
998  ZOOLANDER FICTION
999          ZORRO ARK

[1000 rows x 1 columns]

In [33]:
pd.read_sql("SELECT title FROM film_list WHERE category = 'Documentary';", engine)

                  title
0      ACADEMY DINOSAUR
1      ADAPTATION HOLES
2      ARMY FLINTSTONES
3   BEACH HEARTBREAKERS
4          BED HIGHBALL
..                  ...
63           WARS PLUTO
64       WEDDING APOLLO
65            WIFE TURN
66           WRATH MILE
67       YOUNG LANGUAGE

[68 rows x 1 columns]

In [34]:
pd.read_sql("SELECT * FROM film_list WHERE price BETWEEN 1 AND 3;", engine)

,FID,title,description,category,price,length,rating,actors
0,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,Documentary,2.99,50,NC-17,"NICK WAHLBERG, BOB FAWCETT, CAMERON STREEP, RA..."
1,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,Horror,2.99,117,G,"JODIE DEGENERES, SCARLETT DAMON, KENNETH PESCI..."
2,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,Family,2.99,130,G,"DUSTIN TAUTOU, THORA TEMPLE, MATTHEW CARREY, M..."
3,6,AGENT TRUMAN,A Intrepid Panorama of a Robot And a Boy who m...,Foreign,2.99,169,PG,"KIRSTEN PALTROW, SANDRA KILMER, JAYNE NEESON, ..."
4,9,ALABAMA DEVIL,A Thoughtful Panorama of a Database Administra...,Horror,2.99,114,PG-13,"WARREN NOLTE, GRETA KEITEL, WILLIAM HACKMAN, M..."
...,...,...,...,...,...,...,...,...
318,987,WORDS HUNTER,A Action-Packed Reflection of a Composer And a...,Music,2.99,116,PG,"GENE WILLIS, SUSAN DAVIS, SCARLETT BENING, ADA..."
319,988,WORKER TARZAN,A Action-Packed Yarn of a Secret Agent And a T...,Travel,2.99,139,R,"JULIANNE DENCH, ROCK DUKAKIS, MERYL GIBSON, MI..."
320,991,WORST BANGER,A Thrilling Drama of a Madman And a Dentist wh...,Action,2.99,185,PG,"PARKER GOLDBERG, KIRSTEN AKROYD, SPENCER DEPP,..."
321,993,WRONG BEHAVIOR,A Emotional Saga of a Crocodile And a Sumo Wre...,Children,2.99,178,PG-13,"THORA TEMPLE, GARY PHOENIX, GREGORY GOODING, M..."
322,999,ZOOLANDER FICTION,A Fateful Reflection of a Waitress And a Boat ...,Children,2.99,101,R,"CARMEN HUNT, MARY TANDY, PENELOPE CRONYN, WHOO..."

In [35]:
pd.read_sql("SELECT * FROM film_list WHERE price > 1 AND price < 3;", engine)

,FID,title,description,category,price,length,rating,actors
0,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,Documentary,2.99,50,NC-17,"NICK WAHLBERG, BOB FAWCETT, CAMERON STREEP, RA..."
1,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,Horror,2.99,117,G,"JODIE DEGENERES, SCARLETT DAMON, KENNETH PESCI..."
2,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,Family,2.99,130,G,"DUSTIN TAUTOU, THORA TEMPLE, MATTHEW CARREY, M..."
3,6,AGENT TRUMAN,A Intrepid Panorama of a Robot And a Boy who m...,Foreign,2.99,169,PG,"KIRSTEN PALTROW, SANDRA KILMER, JAYNE NEESON, ..."
4,9,ALABAMA DEVIL,A Thoughtful Panorama of a Database Administra...,Horror,2.99,114,PG-13,"WARREN NOLTE, GRETA KEITEL, WILLIAM HACKMAN, M..."
...,...,...,...,...,...,...,...,...
318,987,WORDS HUNTER,A Action-Packed Reflection of a Composer And a...,Music,2.99,116,PG,"GENE WILLIS, SUSAN DAVIS, SCARLETT BENING, ADA..."
319,988,WORKER TARZAN,A Action-Packed Yarn of a Secret Agent And a T...,Travel,2.99,139,R,"JULIANNE DENCH, ROCK DUKAKIS, MERYL GIBSON, MI..."
320,991,WORST BANGER,A Thrilling Drama of a Madman And a Dentist wh...,Action,2.99,185,PG,"PARKER GOLDBERG, KIRSTEN AKROYD, SPENCER DEPP,..."
321,993,WRONG BEHAVIOR,A Emotional Saga of a Crocodile And a Sumo Wre...,Children,2.99,178,PG-13,"THORA TEMPLE, GARY PHOENIX, GREGORY GOODING, M..."
322,999,ZOOLANDER FICTION,A Fateful Reflection of a Waitress And a Boat ...,Children,2.99,101,R,"CARMEN HUNT, MARY TANDY, PENELOPE CRONYN, WHOO..."

In [36]:
pd.read_sql("DESCRIBE actor_info;", engine)

        Field               Type Null Key Default Extra
0    actor_id  smallint unsigned   NO           0
1  first_name        varchar(45)   NO         NaN
2   last_name        varchar(45)   NO         NaN
3   film_info               text  YES         NaN

In [37]:
pd.read_sql("DESCRIBE country;", engine)

,Field,Type,Null,Key,Default,Extra
0,country_id,smallint unsigned,NO,PRI,NaN,auto_increment
1,country,varchar(50),NO,,NaN,
2,last_update,timestamp,NO,,CURRENT_TIMESTAMP,DEFAULT_GENERATED on update CURRENT_TIMESTAMP

In [38]:
# No olvidar poner comillas al dato de la variable categorica (no olvidar poner comillas a Algeria)
pd.read_sql("SELECT * FROM country WHERE country != 'Algeria';", engine)

     country_id               country         last_update
0             1           Afghanistan 2006-02-15 04:44:00
1             3        American Samoa 2006-02-15 04:44:00
2             4                Angola 2006-02-15 04:44:00
3             5              Anguilla 2006-02-15 04:44:00
4             6             Argentina 2006-02-15 04:44:00
..          ...                   ...                 ...
103         105               Vietnam 2006-02-15 04:44:00
104         106  Virgin Islands, U.S. 2006-02-15 04:44:00
105         107                 Yemen 2006-02-15 04:44:00
106         108            Yugoslavia 2006-02-15 04:44:00
107         109                Zambia 2006-02-15 04:44:00

[108 rows x 3 columns]

In [39]:
pd.read_sql("SELECT * FROM country WHERE country <> 'Algeria';", engine)

     country_id               country         last_update
0             1           Afghanistan 2006-02-15 04:44:00
1             3        American Samoa 2006-02-15 04:44:00
2             4                Angola 2006-02-15 04:44:00
3             5              Anguilla 2006-02-15 04:44:00
4             6             Argentina 2006-02-15 04:44:00
..          ...                   ...                 ...
103         105               Vietnam 2006-02-15 04:44:00
104         106  Virgin Islands, U.S. 2006-02-15 04:44:00
105         107                 Yemen 2006-02-15 04:44:00
106         108            Yugoslavia 2006-02-15 04:44:00
107         109                Zambia 2006-02-15 04:44:00

[108 rows x 3 columns]

In [40]:
pd.read_sql("SELECT * FROM country WHERE country NOT IN ('Algeria', 'ARGENTINA');", engine)

     country_id               country         last_update
0             1           Afghanistan 2006-02-15 04:44:00
1             3        American Samoa 2006-02-15 04:44:00
2             4                Angola 2006-02-15 04:44:00
3             5              Anguilla 2006-02-15 04:44:00
4             7               Armenia 2006-02-15 04:44:00
..          ...                   ...                 ...
102         105               Vietnam 2006-02-15 04:44:00
103         106  Virgin Islands, U.S. 2006-02-15 04:44:00
104         107                 Yemen 2006-02-15 04:44:00
105         108            Yugoslavia 2006-02-15 04:44:00
106         109                Zambia 2006-02-15 04:44:00

[107 rows x 3 columns]

## Practica consultas de agregacion

In [41]:
pd.read_sql("SELECT * FROM film",engine)

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,None,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,None,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",2006-02-15 05:03:42
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,None,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes",2006-02-15 05:03:42
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,None,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes",2006-02-15 05:03:42
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,None,6,2.99,130,22.99,G,Deleted Scenes,2006-02-15 05:03:42
...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,996,YOUNG LANGUAGE,A Unbelieveable Yarn of a Boat And a Database ...,2006,1,None,6,0.99,183,9.99,G,"Trailers,Behind the Scenes",2006-02-15 05:03:42
996,997,YOUTH KICK,A Touching Drama of a Teacher And a Cat who mu...,2006,1,None,4,0.99,179,14.99,NC-17,"Trailers,Behind the Scenes",2006-02-15 05:03:42
997,998,ZHIVAGO CORE,A Fateful Yarn of a Composer And a Man who mus...,2006,1,None,6,0.99,105,10.99,NC-17,Deleted Scenes,2006-02-15 05:03:42
998,999,ZOOLANDER FICTION,A Fateful Reflection of a Waitress And a Boat ...,2006,1,None,5,2.99,101,28.99,R,"Trailers,Deleted Scenes",2006-02-15 05:03:42
999,1000,ZORRO ARK,A Intrepid Panorama of a Mad Scientist And a B...,2006,1,None,3,4.99,50,18.99,NC-17,"Trailers,Commentaries,Behind the Scenes",2006-02-15 05:03:42

In [42]:
pd.read_sql("SELECT rating, COUNT(film_id) AS frecuencia FROM film GROUP BY rating ORDER BY frecuencia DESC",engine)

  rating  frecuencia
0  PG-13         223
1  NC-17         210
2      R         195
3     PG         194
4      G         178

In [43]:
pd.read_sql("SELECT AVG(length) FROM film",engine)

   AVG(length)
0      115.272

In [44]:
pd.read_sql("SELECT rating, AVG(length) AS promedio_duracion FROM film GROUP BY rating ORDER BY promedio_duracion DESC",engine)

  rating  promedio_duracion
0  PG-13           120.4439
1      R           118.6615
2  NC-17           113.2286
3     PG           112.0052
4      G           111.0506

In [45]:
pd.read_sql("SELECT * FROM customer",engine)

,customer_id,store_id,first_name,last_name,email,address_id,active,create_date,last_update
0,1,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,5,1,2006-02-14 22:04:36,2006-02-15 04:57:20
1,2,1,PATRICIA,JOHNSON,PATRICIA.JOHNSON@sakilacustomer.org,6,1,2006-02-14 22:04:36,2006-02-15 04:57:20
2,3,1,LINDA,WILLIAMS,LINDA.WILLIAMS@sakilacustomer.org,7,1,2006-02-14 22:04:36,2006-02-15 04:57:20
3,4,2,BARBARA,JONES,BARBARA.JONES@sakilacustomer.org,8,1,2006-02-14 22:04:36,2006-02-15 04:57:20
4,5,1,ELIZABETH,BROWN,ELIZABETH.BROWN@sakilacustomer.org,9,1,2006-02-14 22:04:36,2006-02-15 04:57:20
...,...,...,...,...,...,...,...,...,...
594,595,1,TERRENCE,GUNDERSON,TERRENCE.GUNDERSON@sakilacustomer.org,601,1,2006-02-14 22:04:37,2006-02-15 04:57:20
595,596,1,ENRIQUE,FORSYTHE,ENRIQUE.FORSYTHE@sakilacustomer.org,602,1,2006-02-14 22:04:37,2006-02-15 04:57:20
596,597,1,FREDDIE,DUGGAN,FREDDIE.DUGGAN@sakilacustomer.org,603,1,2006-02-14 22:04:37,2006-02-15 04:57:20
597,598,1,WADE,DELVALLE,WADE.DELVALLE@sakilacustomer.org,604,1,2006-02-14 22:04:37,2006-02-15 04:57:20
598,599,2,AUSTIN,CINTRON,AUSTIN.CINTRON@sakilacustomer.org,605,1,2006-02-14 22:04:37,2006-02-15 04:57:20

In [46]:
pd.read_sql("SELECT store_id, COUNT(customer_id) FROM customer GROUP BY store_id", engine)

   store_id  COUNT(customer_id)
0         1                 326
1         2                 273

In [47]:
pd.read_sql("SELECT * FROM payment",engine)

,payment_id,customer_id,staff_id,rental_id,amount,payment_date,last_update
0,1,1,1,76,2.99,2005-05-25 11:30:37,2006-02-15 22:12:30
1,2,1,1,573,0.99,2005-05-28 10:35:23,2006-02-15 22:12:30
2,3,1,1,1185,5.99,2005-06-15 00:54:12,2006-02-15 22:12:30
3,4,1,2,1422,0.99,2005-06-15 18:02:53,2006-02-15 22:12:30
4,5,1,2,1476,9.99,2005-06-15 21:08:46,2006-02-15 22:12:30
...,...,...,...,...,...,...,...
16039,16045,599,1,14599,4.99,2005-08-21 17:43:42,2006-02-15 22:24:12
16040,16046,599,1,14719,1.99,2005-08-21 21:41:57,2006-02-15 22:24:12
16041,16047,599,2,15590,8.99,2005-08-23 06:09:44,2006-02-15 22:24:12
16042,16048,599,2,15719,2.99,2005-08-23 11:08:46,2006-02-15 22:24:13
16043,16049,599,2,15725,2.99,2005-08-23 11:25:00,2006-02-15 22:24:13

In [48]:
pd.read_sql("SELECT customer_id, AVG(amount) FROM payment GROUP BY customer_id", engine)

     customer_id  AVG(amount)
0              1     3.708750
1              2     4.767778
2              3     5.220769
3              4     3.717273
4              5     3.805789
..           ...          ...
594          595     3.923333
595          596     3.454286
596          597     3.990000
597          598     3.808182
598          599     4.411053

[599 rows x 2 columns]

In [49]:
pd.read_sql("SELECT * FROM film",engine)

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,None,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,None,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",2006-02-15 05:03:42
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,None,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes",2006-02-15 05:03:42
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,None,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes",2006-02-15 05:03:42
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,None,6,2.99,130,22.99,G,Deleted Scenes,2006-02-15 05:03:42
...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,996,YOUNG LANGUAGE,A Unbelieveable Yarn of a Boat And a Database ...,2006,1,None,6,0.99,183,9.99,G,"Trailers,Behind the Scenes",2006-02-15 05:03:42
996,997,YOUTH KICK,A Touching Drama of a Teacher And a Cat who mu...,2006,1,None,4,0.99,179,14.99,NC-17,"Trailers,Behind the Scenes",2006-02-15 05:03:42
997,998,ZHIVAGO CORE,A Fateful Yarn of a Composer And a Man who mus...,2006,1,None,6,0.99,105,10.99,NC-17,Deleted Scenes,2006-02-15 05:03:42
998,999,ZOOLANDER FICTION,A Fateful Reflection of a Waitress And a Boat ...,2006,1,None,5,2.99,101,28.99,R,"Trailers,Deleted Scenes",2006-02-15 05:03:42
999,1000,ZORRO ARK,A Intrepid Panorama of a Mad Scientist And a B...,2006,1,None,3,4.99,50,18.99,NC-17,"Trailers,Commentaries,Behind the Scenes",2006-02-15 05:03:42

In [53]:
#Ratings con más de 200 películas
pd.read_sql("SELECT COUNT(*), rating FROM film GROUP BY rating HAVING COUNT(*)>200",engine)

   COUNT(*) rating
0       210  NC-17
1       223  PG-13